InformationRegisters/РегистрацияЗвонковИКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияЗвонковИКонтактов</Name>
			<Comment>Регистр служит для хранения истории звонков и контактов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реклама</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВторичныйКонтакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыОбращения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Comment>Сотрудник, которому предназначено напоминание для зарегистрированного события</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРегиона</Name>
					<Comment>Код региона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГорода</Name>
					<Comment>Код города</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеТелефона</Name>
					<Comment>Представление телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТелефона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСобытие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистСервиса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПокупки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПокупки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУдалосьСоединить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДень</Name>
					<Comment>Дата (день)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Comment>Дата (время)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>510</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>streceptionURN</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналСостояний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСостояний</Name>
			<Comment>Журнал состояний заказ-нарядов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаказНарядов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыРабочегоЛиста</v8:Type>
						<v8:Type>cfg:EnumRef.СостояниеЖалобКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор изменения состояния</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>Компьютер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект состояния</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеКлиентаHyundai</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистКредитногоОтдела</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистСервиса</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистОтделаСтрахования</v8:Type>
						<v8:Type>cfg:DocumentRef.Рассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПовторныйРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЖалобаКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматТекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФорматТекста</Name>
			<Comment>Тип текста HTML или Простой текст</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
					<Comment>Формат текста HTML </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<Comment>Текстовый формат </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСобытий</Name>
			<Comment>Состояния событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
					<Comment>Отменено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ПроцедурыДляАвтоваз/Ext/Module.bsl
/////////////////////////////////////////////////
// Воронка продаж для CRM АвтоВАЗ

Процедура ОтправитьТрафикДляАвтоВАЗ()
	ТекущаяДата = ТекущаяДата();
	ТекущаяДатаСтрокой = Формат(ТекущаяДата, "ДЛФ=Д");
	
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
	АдресЭлПочты = "IN1@pss.vaz.ru";
	СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
	СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
	СтрокаПолучатели.Представление = АдресЭлПочты;
	СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
    ЭлПисьмо.ПолучателиПредставление = АдресЭлПочты;
	
	ЭлПисьмо.Тема = "Трафик по ООО Транзит на " + Формат(ТекущаяДата, "ДЛФ=ДД");
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.ОтправительПредставление = "Альфа-Авто <" + ЭлПисьмо.УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;	
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
	ЭлПисьмо.ДатаОтправления = ТекущаяДата;
	ЭлПисьмо.Дата = ТекущаяДата;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
	
	Организация = Справочники.Организации.НайтиПоКоду("ЦБ000014"); // ООО Транзит
	ГруппаМоделей = Справочники.Модели.НайтиПоКоду("ЦБ00004134"); // ВАЗ(Lada)
	Если обЗначениеНеЗаполнено(Организация) Или обЗначениеНеЗаполнено(ГруппаМоделей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));			   
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));			   
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГруппаМоделей", ГруппаМоделей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК СпособОбращения,
	               |	РегистрацияЗвонковИКонтактов.Подразделение КАК Подразделение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 9
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с9до10,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 10
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с10до11,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 11
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с11до12,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 12
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с12до13,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 13
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с13до14,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 14
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с14до15,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 15
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с15до16,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 16
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с16до17,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 17
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с17до18,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 18
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с18до19,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 19
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с19до20,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЧАС(РегистрацияЗвонковИКонтактов.ДатаВремя) = 20
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК с20до21
	               |ИЗ
	               |	РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов
	               |ГДЕ
	               |	РегистрацияЗвонковИКонтактов.ДатаДень МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И РегистрацияЗвонковИКонтактов.Организация = &Организация
	               |	И РегистрацияЗвонковИКонтактов.Модель В ИЕРАРХИИ(&ГруппаМоделей)
	               |	И (РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |			ИЛИ РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	РегистрацияЗвонковИКонтактов.Подразделение";
				   
	Трафик = Запрос.Выполнить().Выгрузить();
	ЗаголовокСтроки = СокрЛП(Организация.ИНН) + ";" + СокрЛП(Организация.Наименование);
	ВолгодонскЛада = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000189");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();   
	Запись = Новый ЗаписьТекста(ИмяВременногоФайла, "windows-1251");
	Для Каждого СтрокаТрафика Из Трафик Цикл
		НомерФилиала = "0";
		Если ЗначениеЗаполнено(ВолгодонскЛада) 
			И (СтрокаТрафика.Подразделение = ВолгодонскЛада Или СтрокаТрафика.Подразделение.ПринадлежитЭлементу(ВолгодонскЛада)) Тогда
			НомерФилиала = "1";
		КонецЕсли;
		СтрокаФайла = ЗаголовокСтроки + ";" + НомерФилиала;
		СтрокаФайла = СтрокаФайла + ";" + ТекущаяДатаСтрокой;
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.СпособОбращения);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с9до10);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с10до11);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с11до12);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с12до13);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с13до14);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с14до15);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с15до16);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с16до17);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с17до18);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с18до19);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с19до20);
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.с20до21);		
		Запись.ЗаписатьСтроку(СтрокаФайла);
	КонецЦикла;		
	Запись.Закрыть();
	
	ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
	ДвДанныеВложения = Новый ДвоичныеДанные(ИмяВременногоФайла);	
	ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанныеВложения);
	ФайлВложение.Имя = "traffic.csv";
	ВременныйФайл = Новый Файл(ИмяВременногоФайла);
	ФайлВложение.Размер = ВременныйФайл.Размер();
	
	ЭлПисьмо.ЕстьВложения = Истина;
	ЭлПисьмо.Записать();
	УдалитьФайлы(ИмяВременногоФайла);	
	
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если Не эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			//ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаАвтомобилиБУСтарыеЗапасы", 
			//        УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить письмо!"); 
		КонецЕсли;	
		эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
	КонецЕсли;		
КонецПроцедуры

Процедура ОтправитьВоронкуДляАвтоВАЗ()
	ТекущаяДата = ТекущаяДата();
	ТекущаяДатаСтрокой = Формат(ТекущаяДата, "ДЛФ=Д");
	
	ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
	АдресЭлПочты = "IN1@pss.vaz.ru";
	СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
	СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
	СтрокаПолучатели.Представление = АдресЭлПочты;
	СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
    ЭлПисьмо.ПолучателиПредставление = АдресЭлПочты;
	
	ЭлПисьмо.Тема = "Воронка продаж по ООО Транзит на " + Формат(ТекущаяДата, "ДЛФ=ДД");
	ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	ЭлПисьмо.ОтправительПредставление = "Альфа-Авто <" + ЭлПисьмо.УчетнаяЗапись.АдресЭлектроннойПочты + ">";
	ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;	
	ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
	ЭлПисьмо.ДатаОтправления = ТекущаяДата;
	ЭлПисьмо.Дата = ТекущаяДата;
	ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
	
	Организация = Справочники.Организации.НайтиПоКоду("ЦБ000014"); // ООО Транзит
	ГруппаМоделей = Справочники.Модели.НайтиПоКоду("ЦБ00004134"); // ВАЗ(Lada)
	Если обЗначениеНеЗаполнено(Организация) Или обЗначениеНеЗаполнено(ГруппаМоделей) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата));			   
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата));			   
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГруппаМоделей", ГруппаМоделей);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрацияЗвонковИКонтактов.Подразделение КАК Подразделение,
	               |	РегистрацияЗвонковИКонтактов.Автор.Сотрудник.Наименование КАК Сотрудник,
	               |	РегистрацияЗвонковИКонтактов.Автор.Сотрудник.Должность.Наименование КАК Должность,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.РабочийЛист ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК СозданоРабочихЛистов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЗарегистрированоЗвонков,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |					И РегистрацияЗвонковИКонтактов.ПредставлениеТелефона <> """"
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КонтактовСоЗвонков,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЗарегистрированоВизитов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
	               |					И РегистрацияЗвонковИКонтактов.ПредставлениеТелефона <> """"
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КонтактовСВизитов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЭлектронноеПисьмо)
	               |					ИЛИ РегистрацияЗвонковИКонтактов.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЗаявкаССайта)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ЗарегистрированоИнтернетОбращений,
	               |	СУММА(0) КАК ВизитовПоРабочимЛистам,
	               |	СУММА(0) КАК ЗаписейНаТестДрайв,
	               |	СУММА(0) КАК ВыданныхАвтомобилей,
	               |	СУММА(0) КАК ПросроченныхСобытий,
	               |	СУММА(0) КАК ОтказовОтАвтомобиля,
	               |	СУММА(0) КАК РабочихЛистовИнтерес,
	               |	СУММА(0) КАК РабочихЛистовСделка
	               |ПОМЕСТИТЬ Трафик
	               |ИЗ
	               |	РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов
	               |ГДЕ
	               |	РегистрацияЗвонковИКонтактов.ДатаДень МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И РегистрацияЗвонковИКонтактов.Организация = &Организация
	               |	И РегистрацияЗвонковИКонтактов.Модель В ИЕРАРХИИ(&ГруппаМоделей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РегистрацияЗвонковИКонтактов.Подразделение,
	               |	РегистрацияЗвонковИКонтактов.Автор.Сотрудник.Наименование,
	               |	РегистрацияЗвонковИКонтактов.Автор.Сотрудник.Должность.Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Событие.ПодразделениеКомпании,
	               |	Событие.Продавец.Наименование,
	               |	Событие.Продавец.Должность.Наименование,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
	               |					И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТестДрайв)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ВыдачаАвтомобиля)
	               |					И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Завершено)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА Событие.ДатаОкончания < &ДатаОкончания
	               |					И Событие.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ОтказОтАвтомобиля)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(0),
	               |	СУММА(0)
	               |ИЗ
	               |	Документ.Событие КАК Событие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РабочийЛист КАК РабочийЛист
	               |		ПО Событие.ДокументОснование = РабочийЛист.Ссылка
	               |ГДЕ
	               |	Событие.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И Событие.Организация = &Организация
	               |	И РабочийЛист.Модель В ИЕРАРХИИ(&ГруппаМоделей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Событие.ПодразделениеКомпании,
	               |	Событие.Продавец.Наименование,
	               |	Событие.Продавец.Должность.Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РабочийЛист.ПодразделениеКомпании,
	               |	РабочийЛист.Менеджер.Наименование,
	               |	РабочийЛист.Менеджер.Должность.Наименование,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА ЖурналСостояний.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Интерес)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ЖурналСостояний.Состояние = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Сделка)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ)
	               |ИЗ
	               |	Документ.РабочийЛист КАК РабочийЛист
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСостояний КАК ЖурналСостояний
	               |		ПО РабочийЛист.Ссылка = ЖурналСостояний.Объект
	               |ГДЕ
	               |	ЖурналСостояний.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И РабочийЛист.Организация = &Организация
	               |	И РабочийЛист.Модель В ИЕРАРХИИ(&ГруппаМоделей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РабочийЛист.ПодразделениеКомпании,
	               |	РабочийЛист.Менеджер.Наименование,
	               |	РабочийЛист.Менеджер.Должность.Наименование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РабочийЛист.ПодразделениеКомпании,
	               |	РабочийЛист.Менеджер.Наименование,
	               |	РабочийЛист.Менеджер.Должность.Наименование,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(ВЫБОР
	               |			КОГДА РабочийЛист.ВидКонтакта = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ЛичнаяВстреча)
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0)
	               |ИЗ
	               |	Документ.РабочийЛист КАК РабочийЛист
	               |ГДЕ
	               |	РабочийЛист.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И РабочийЛист.Организация = &Организация
	               |	И РабочийЛист.Модель В ИЕРАРХИИ(&ГруппаМоделей)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РабочийЛист.ПодразделениеКомпании,
	               |	РабочийЛист.Менеджер.Наименование,
	               |	РабочийЛист.Менеджер.Должность.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Трафик.Подразделение,
	               |	Трафик.Сотрудник,
	               |	Трафик.Должность,
	               |	СУММА(Трафик.СозданоРабочихЛистов) КАК СозданоРабочихЛистов,
	               |	СУММА(Трафик.ЗарегистрированоЗвонков) КАК ЗарегистрированоЗвонков,
	               |	СУММА(Трафик.КонтактовСоЗвонков) КАК КонтактовСоЗвонков,
	               |	СУММА(Трафик.ЗарегистрированоВизитов) КАК ЗарегистрированоВизитов,
	               |	СУММА(Трафик.КонтактовСВизитов) КАК КонтактовСВизитов,
	               |	СУММА(Трафик.ЗарегистрированоИнтернетОбращений) КАК ЗарегистрированоИнтернетОбращений,
	               |	СУММА(Трафик.ВизитовПоРабочимЛистам) КАК ВизитовПоРабочимЛистам,
	               |	СУММА(Трафик.ЗаписейНаТестДрайв) КАК ЗаписейНаТестДрайв,
	               |	СУММА(Трафик.ВыданныхАвтомобилей) КАК ВыданныхАвтомобилей,
	               |	СУММА(Трафик.ПросроченныхСобытий) КАК ПросроченныхСобытий,
	               |	СУММА(Трафик.ОтказовОтАвтомобиля) КАК ОтказовОтАвтомобиля,
	               |	СУММА(Трафик.РабочихЛистовИнтерес) КАК РабочихЛистовИнтерес,
	               |	СУММА(Трафик.РабочихЛистовСделка) КАК РабочихЛистовСделка
	               |ИЗ
	               |	Трафик КАК Трафик
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Трафик.Подразделение,
	               |	Трафик.Сотрудник,
	               |	Трафик.Должность";
				   
	Трафик = Запрос.Выполнить().Выгрузить();
	ЗаголовокСтроки = СокрЛП(Организация.ИНН) + ";" + СокрЛП(Организация.Наименование);
	ВолгодонскЛада = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000189");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();   
	Запись = Новый ЗаписьТекста(ИмяВременногоФайла, "windows-1251");
	Для Каждого СтрокаТрафика Из Трафик Цикл
		НомерФилиала = "0";
		Если ЗначениеЗаполнено(ВолгодонскЛада) 
			И (СтрокаТрафика.Подразделение = ВолгодонскЛада Или СтрокаТрафика.Подразделение.ПринадлежитЭлементу(ВолгодонскЛада)) Тогда
			НомерФилиала = "1";
		КонецЕсли;
		СтрокаФайла = ЗаголовокСтроки + ";" + НомерФилиала; // поле 3
		СтрокаФайла = СтрокаФайла + ";" + Лев(СтрокаТрафика.Сотрудник, 100); // поле 4
		
		Если Найти(СтрокаТрафика.Должность, "Администратор") > 0 Тогда
			СтрокаФайла = СтрокаФайла + ";Ассистент";
		ИначеЕсли Найти(СтрокаТрафика.Должность, "Менеджер") > 0 Тогда
			СтрокаФайла = СтрокаФайла + ";Продавец-консультант";
		ИначеЕсли Найти(СтрокаТрафика.Должность, "Руководитель") > 0 Тогда
			СтрокаФайла = СтрокаФайла + ";Руководитель Отдела Продаж";
		Иначе
			СтрокаФайла = СтрокаФайла + ";Продавец-консультант";
		КонецЕсли;
		
		СтрокаФайла = СтрокаФайла + ";" + ТекущаяДатаСтрокой; // поле 6
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.СозданоРабочихЛистов); // поле 7
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ЗарегистрированоЗвонков); // поле 8
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.КонтактовСоЗвонков); // поле 9
		СтрокаФайла = СтрокаФайла + ";" + "0"; // поле 10
		СтрокаФайла = СтрокаФайла + ";" + "0"; // поле 11
		СтрокаФайла = СтрокаФайла + ";" + "0"; // поле 12
		СтрокаФайла = СтрокаФайла + ";" + "0"; // поле 13
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ЗарегистрированоВизитов); // поле 14
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.КонтактовСВизитов); // поле 15
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ЗарегистрированоИнтернетОбращений); // поле 16
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ВизитовПоРабочимЛистам); // поле 17		
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ЗаписейНаТестДрайв); // поле 18
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.РабочихЛистовИнтерес); // поле 19
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.РабочихЛистовСделка); // поле 20
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ОтказовОтАвтомобиля); // поле 21
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ВыданныхАвтомобилей); // поле 22
		
		Если СтрокаТрафика.ВизитовПоРабочимЛистам = 0 Или СтрокаТрафика.ВыданныхАвтомобилей = 0 Тогда
			СтрокаФайла = СтрокаФайла + ";" + "0"; // поле 23
		Иначе
			СтрокаФайла = СтрокаФайла + ";" + Формат(СтрокаТрафика.ВыданныхАвтомобилей / СтрокаТрафика.ВизитовПоРабочимЛистам * 100, "ЧДЦ=0"); // поле 23
		КонецЕсли;
		
		СтрокаФайла = СтрокаФайла + ";" + Строка(СтрокаТрафика.ПросроченныхСобытий); // поле 24		
		Запись.ЗаписатьСтроку(СтрокаФайла);
	КонецЦикла;		
	Запись.Закрыть();
	
	ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
	ДвДанныеВложения = Новый ДвоичныеДанные(ИмяВременногоФайла);	
	ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанныеВложения);
	ФайлВложение.Имя = "voronka.csv";
	ВременныйФайл = Новый Файл(ИмяВременногоФайла);
	ФайлВложение.Размер = ВременныйФайл.Размер();
	
	ЭлПисьмо.ЕстьВложения = Истина;
	ЭлПисьмо.Записать();
	УдалитьФайлы(ИмяВременногоФайла);	
	
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если Не эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			//ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаАвтомобилиБУСтарыеЗапасы", 
			//        УровеньЖурналаРегистрации.Ошибка, , , "Не удалось отправить письмо!"); 
		КонецЕсли;	
		эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
	КонецЕсли;		
КонецПроцедуры

Процедура ВыгрузкаДляCRMАвтоВАЗ(Параметры = Неопределено) Экспорт
	ОтправитьТрафикДляАвтоВАЗ();
	ОтправитьВоронкуДляАвтоВАЗ();
КонецПроцедуры

/////////////////////////////////////////////////
// Выгрузка в ИС «Лада Гарантия»

Процедура СформироватьДанныеЛадаГарантия(КодДилера, ДатаНачала, ДатаОкончания) Экспорт
	Если КодДилера = "34417" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000166"); // Транзит ООО Волгодонск Лада
		ЛогинОператора = "vasilchenko_34417";
		ЛогинИПГ = "vasilchenko_34417";
	ИначеЕсли КодДилера = "?????" Тогда
		Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000247"); // Транзит ООО Рассвет
		ЛогинОператора = "??????????";
		ЛогинИПГ = "??????????";
	Иначе
		Возврат;
	КонецЕсли;
	СписокВидовРемонта = Новый Массив();
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителя);
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ГарантияПроизводителяЛКП);
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ТехническоеОбслуживание);
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.ТО_ноль);
	
	URIПространства_pas = "urn:itcauto.ru:PSSSActSend:1.0.0"; 
	URIПространства_cat = "urn:itcauto.ru:CommonAggregateTypes:1.0.0"; 
	URIПространства_xsi = "http://www.w3.org/2001/XMLSchema-instance"; 
	
	ДокументDOM = Новый ДокументDOM(URIПространства_pas, "pas:PSSSActSend");
	ДокументDOM.ВерсияXML = "1.0";	 
	КореньDOM = ДокументDOM.ЭлементДокумента;
	
	//КореньDOM.УстановитьСоответствиеПространстваИмен("pas", URIПространства_pas);
	КореньDOM.УстановитьСоответствиеПространстваИмен("cat", URIПространства_cat);
	КореньDOM.УстановитьСоответствиеПространстваИмен("xsi", URIПространства_xsi);
    КореньDOM.УстановитьАтрибут(URIПространства_xsi, "xsi:schemaLocation", "urn:itcauto.ru:PSSSActSend:1.0.0 01_PSSS_ActSend.xsd");

	////////////////////////////////////////////////
	// Заголовок сообщения pas:MessageInfo
	ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_pas, "pas:MessageInfo");
	
	ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:MessageID");	
	ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Новый УникальныйИдентификатор());
	ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
	
	ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:PSSSCode");	
	ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(КодДилера);
	ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
	
	ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:MessageDateTime");	
	ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Формат(ТекущаяДата(), "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
	ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
	
	ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:MessageTypeCode");	
	ДочернийЭлементDOM.ТекстовоеСодержимое = "AGO";
	ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
	
	КореньDOM.ДобавитьДочерний(ЭлементDOM); // pas:MessageInfo

	////////////////////////////////////////////////
	// Загрузить данные	
	ЗапросЗаказНаряды = Новый Запрос();
	ЗапросЗаказНаряды.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	ЗапросЗаказНаряды.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	ЗапросЗаказНаряды.УстановитьПараметр("Подразделение", Подразделение);
	ЗапросЗаказНаряды.УстановитьПараметр("Закрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	ЗапросЗаказНаряды.УстановитьПараметр("LADA", Справочники.Марка.LADA_ВАЗ);
	ЗапросЗаказНаряды.УстановитьПараметр("СписокВидовРемонта", СписокВидовРемонта);
	ЗапросЗаказНаряды.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРемонт.Номер КАК ЗаявкаНомер,
	|	ЗаявкаНаРемонт.Дата КАК ЗаявкаДата,
	|	ЗаявкаНаРемонт.Диспетчер КАК ЗаявкаДиспетчер,
	|	ЗаказНаряд.Ссылка КАК ЗаказНарядСсылка,
	|	ЗаказНаряд.Номер КАК ЗаказНарядНомер,
	|	ЗаказНаряд.ДатаСоздания КАК ДатаСоздания,
	|	ЗаказНаряд.ДатаЗакрытия КАК ДатаЗакрытия,
	|	ЗаказНаряд.Пробег КАК Пробег,
	|	ЗаказНаряд.Автомобиль.VIN КАК VIN,
	|	ВЫБОР
	|		КОГДА ЗаказНаряд.ВидРемонта.ГарантияЗавода
	|			ТОГДА ""AGO""
	|		ИНАЧЕ ""ATO""
	|	КОНЕЦ КАК КодВидаРемонта,
	|	ЗаказНаряд.Заказчик КАК Заказчик,
	|	ЗаказНаряд.Заказчик.ФормаСобственности КАК ЗаказчикФормаСобственности,
	|	ЕСТЬNULL(ЗаказНаряд.Заказчик.ИНН, """") КАК ЗаказчикИНН,
	|	ЗаказНаряд.Заказчик.Пол КАК ЗаказчикПол,
	|	ЕСТЬNULL(ЗаказНаряд.Заказчик.ОсновнойТелефон, """") КАК ЗаказчикТелефон
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|		ПО ЗаказНаряд.ДокументОснование = ЗаявкаНаРемонт.Ссылка
	|ГДЕ
	|	ЗаказНаряд.Состояние = &Закрыт
	|	И ЗаказНаряд.Автомобиль.Модель.Марка = &LADA
	|	И ЗаказНаряд.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказНаряд.ПодразделениеКомпании = &Подразделение
	|	И ЗаказНаряд.ВидРемонта В(&СписокВидовРемонта)";
	
	ЗапросТовары = Новый Запрос();
	ЗапросТовары.Текст =
	"ВЫБРАТЬ
	|	ЗаказНарядТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказНарядТовары.Номенклатура.Производитель КАК Производитель,
	|	ЗаказНарядТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказНарядТовары.Количество КАК Количество,
	|	ЗаказНарядТовары.Цена КАК Цена
	|ИЗ
	|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	|ГДЕ
	|	ЗаказНарядТовары.Ссылка = &ЗаказНаряд";
	
	ЗапросПаспорт = Новый Запрос();
	ЗапросПаспорт.УстановитьПараметр("Паспорт", Перечисления.ВидыДокументов.Паспорт);
	ЗапросПаспорт.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия,
	|	ПодтверждающиеДокументы.Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Заказчик
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Паспорт
	|	И ПодтверждающиеДокументы.Текущий";
	
	////////////////////////////////////////////////
	// Заказ-наряды pas:ActData
    ЭлементActData = ДокументDOM.СоздатьЭлемент(URIПространства_pas, "pas:ActData"); // pas:ActData - Заказ-наряды
	
	ВыборкаЗН = ЗапросЗаказНаряды.Выполнить().Выбрать();
	Пока ВыборкаЗН.Следующий() Цикл
	    ЭлементOrder = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Order"); // cat:Order - Заказ-наряд
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Request"); // Заявка на ремонт		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:RequestNum");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.ЗаявкаНомер);
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:RequestDate");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Формат(ВыборкаЗН.ЗаявкаДата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:PSSSCode");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(КодДилера);
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Run");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.Пробег);
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);	
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:InspPersonnelName");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ЛогинОператора);
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);	
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Description");	
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);	
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM); // Заявка на ремонт
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Car"); // Автомобиль		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:VINCode");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.VIN);
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM); // Автомобиль
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:OrderNum");	
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.ЗаказНарядНомер);
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:OrderDate");	
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Формат(ВыборкаЗН.ДатаСоздания, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:OrderTypeCode");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.КодВидаРемонта);
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:EngineerName");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ЛогинИПГ);
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM);
		
		///// возможно, здесь будет цикл по дефектам ???
		ЭлементDefectInOrder = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DefectInOrder");
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Defect"); // Дефект		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DetailTypeNum");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("????????????");
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DefectCode");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("?????");
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		
		ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DefectPlace");	
		ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("?????");
		ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM); // Дефект
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Num");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("1");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Description");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????????");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Commentary");
		//ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????????");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:GuaranteeTypeCode");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????????");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:MainDetail"); // cat:MainDetail
		//ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????????");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM); // cat:MainDetail
		
		///// Товары
		ЗапросТовары.УстановитьПараметр("ЗаказНаряд", ВыборкаЗН.ЗаказНарядСсылка);
		ВыборкаТовары = ЗапросТовары.Выполнить().Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ЭлементDetailInOrder = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DetailInOrder"); // cat:DetailInOrder
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Detail"); // cat:Detail
			ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DetailTypeNum");	
			ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаТовары.Артикул);
			ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
			
			ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DetailBaseModel");	
			ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????");
			ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
			
			ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DetailVersion");	
			ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??");
			ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
			
			ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Producer");	
			ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("?????");
			ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM); // cat:Detail
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Num");
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаТовары.НомерСтроки);
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:IsInstalled");
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??");
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Quantity");
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаТовары.Количество);
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Price");
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаТовары.Цена);
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:ProductionDate");
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("????????");
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Commentary");
			//ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("????????";
			ЭлементDetailInOrder.ДобавитьДочерний(ЭлементDOM);
			
			ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDetailInOrder); // cat:DetailInOrder
		КонецЦикла;
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:MechanicName"); // cat:MechanicName
		//ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("??????????");
		ЭлементDefectInOrder.ДобавитьДочерний(ЭлементDOM); // cat:MechanicName
			
		ЭлементOrder.ДобавитьДочерний(ЭлементDefectInOrder);
		///// возможно, здесь будет конец цикла по дефектам ???
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:OrderCloseDate");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Формат(ВыборкаЗН.ДатаЗакрытия, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
		ЭлементOrder.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементClient = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Client"); // cat:Client
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Phone");
		Если ЗначениеЗаполнено(ВыборкаЗН.ЗаказчикТелефон) Тогда
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.ЗаказчикТелефон);
		Иначе
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("ОТКАЗ");
		КонецЕсли;
		ЭлементClient.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Email");
		Email = киПолучитьПредставлениеКИ(ВыборкаЗН.Заказчик, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Если ЗначениеЗаполнено(Email) Тогда
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Email);
		КонецЕсли;
		ЭлементClient.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Address");
		Адрес = киПолучитьПредставлениеКИ(ВыборкаЗН.Заказчик, Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Адрес);
		ЭлементClient.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:INN");
		Если ЗначениеЗаполнено(ВыборкаЗН.ЗаказчикИНН) Тогда
			ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.ЗаказчикИНН);
		КонецЕсли;
		ЭлементClient.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Name");
		ЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаЗН.Заказчик.Наименование);
		ЭлементClient.ДобавитьДочерний(ЭлементDOM);
		
		ЭлементClientIndividualPerson = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:ClientIndividualPerson"); // cat:ClientIndividualPerson
		Если ВыборкаЗН.ЗаказчикФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:IndividualPersonDoc");
			ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocType");	
			ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока("PASSPORT");
			ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
			
			ЗапросПаспорт.УстановитьПараметр("Заказчик", ВыборкаЗН.Заказчик);
			ВыборкаПаспорт = ЗапросПаспорт.Выполнить().Выбрать();
			Если ВыборкаПаспорт.Следующий() Тогда
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocSeries");	
				ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаПаспорт.Серия);
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocNumber");	
				ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаПаспорт.Номер);
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocDate");	
				ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(Формат(ВыборкаПаспорт.ДатаВыдачи, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocOrgan");	
				ДочернийЭлементDOM.ТекстовоеСодержимое = XMLСтрока(ВыборкаПаспорт.КемВыдан);
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);		
			Иначе
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocSeries");	
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocNumber");	
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocDate");	
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);
				
				ДочернийЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:DocOrgan");	
				ЭлементDOM.ДобавитьДочерний(ДочернийЭлементDOM);		
			КонецЕсли;
			ЭлементClientIndividualPerson.ДобавитьДочерний(ЭлементDOM); // cat:IndividualPersonDoc
			
			ЭлементDOM = ДокументDOM.СоздатьЭлемент(URIПространства_cat, "cat:Sex");
			Если ВыборкаЗН.ЗаказчикПол = Перечисления.ПолФизическихЛиц.Женский Тогда
				ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("1");
			Иначе
				ЭлементDOM.ТекстовоеСодержимое = XMLСтрока("0");
			КонецЕсли;
			ЭлементClientIndividualPerson.ДобавитьДочерний(ЭлементDOM);	
		Иначе
			// добавлять пустые элементы или нет???
		КонецЕсли;
		ЭлементClient.ДобавитьДочерний(ЭлементClientIndividualPerson); // cat:ClientIndividualPerson
			
		ЭлементOrder.ДобавитьДочерний(ЭлементClient);  // cat:Client	
		/////////////////////////////////////////////////
		ЭлементActData.ДобавитьДочерний(ЭлементOrder); // cat:Order - Заказ-наряд
	КонецЦикла; // по заказ-нарядам
	КореньDOM.ДобавитьДочерний(ЭлементActData); // pas:ActData - Заказ-наряды

	/////////////////////////////////////////////////
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл("C:\Users\semenikhin_i\Desktop\LadaDOM.xml", "UTF-8");
	//ЗаписьXML.УстановитьСтроку("UTF-8");
	
	ЗаписьDOM = Новый ЗаписьDOM();
	// Сохраняем полученное в XML файл
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	// Важно всегда закрывать файл записи
	//ЗаписьXML.Закрыть();
	СтрокаXML = ЗаписьXML.Закрыть();
	/////////////////////////////////////////////////
КонецПроцедуры

////////////////////////////////////////////////////////////
